TOKEN = 'NzcyMzU3NzY0MjQ0NTcwMTIy.X55gOA.5XcGmmWK80bOdf1PI8Q9iBMYaBk'
CLIENT_ID = '772357764244570122'

# Тексты для команд
user_panel1 = 'Дополнительные возможности:\n\
    /his - история заказов\n\
    /help - помощь в создании заказа'
commands = '/close [id id заказа] - Закрыть заказ\n/end [id id заказа] - Подтвердить исполнение заказа'
commands_cab = '/history - Исторя заказов\n/choose [wallet_name] [wallet_address] - изменить кошелек\n/user_help - помощь по работе с ботом'


# Тексты для embeds
desc_1 = "Выберите ключ:\n\n\
    1️⃣ - Siege of Boralus\n\
    2️⃣ - Freehold\n\
    3️⃣ - Shrine of the Storm\n\
    4️⃣ - Tol Dagor\n\
    5️⃣ - Waycrest Manor\n\
    6️⃣ - Atal'Dazar\n\
    7️⃣ - The MOTHERLODE!!!\n\
    8️⃣ - Temple of Sethrailiss\n\
    9️⃣ - The Underrot\n\
    🔟 - King's Rest\n\
    #️⃣ - Junkyard\n\
    *️⃣ - Workshop\n\
    ❌ - отменить заказ\n"
desc_2 = "Выберите фракцию:\n\n\
    1️⃣ - EU-Horde\n\
    2️⃣ - EU-Alliance\n\
    3️⃣ - US-Horde\n\
    4️⃣ - US-Alliance\n\
    ❌ - отменить заказ"
desc_3 = "Меню создание:\n\n\
    ➕ - Указать роль\n\
    ❌ - отменить заказ"
desc_4 = "Нужен ключ?\n\n\
    ✅ - Да\n\
    ❌ - Нет"
desc_5 = "Выберите роль:\n\n\
    1️⃣ - Tank\n\
    2️⃣ - Dps\n\
    3️⃣ - Heal\n\
    ❌ - отменить заказ\n"
desc_6 = "Выберите тип брони:\n\n\
    1️⃣ - Латы\n\
    2️⃣ - Кольчуга\n\
    3️⃣ - Кожа\n\
    4️⃣ - Ткань\n\
    5️⃣ - Не указывать\n\
    ❌ - отменить заказ\n"
desc_6_tank = "Выберите тип брони:\n\n\
    1️⃣ - Латы\n\
    2️⃣ - Кожа\n\
    3️⃣ - Не указывать\n\
    ❌ - отменить заказ\n"
desc_7 = 'Создать новый заказ - /new_order [ключ] [кол-во участников]'
desc_8 = '✅ - зарегистрироваться\n❌ - отказаться' 
desc_9 = 'Выбери роль, на которую ты хочешь зарегистрироваться'


# Словари с payload для реакций

keyses = {"1️⃣": "Siege of Boralus", "2️⃣": "Freehold", "3️⃣": "Shrine of the Storm", "4️⃣": "Tol Dagor", 
		"5️⃣": "Waycrest Manor", "6️⃣": "Atal'Dazar", "7️⃣": "The MOTHERLODE!!!", "8️⃣": "Temple of Sethrailiss", 
		"9️⃣": "The Underrot", "🔟": "King's Rest", "#️⃣": "Junkyard", "*️⃣": "Workshop"}
fractions = {"1️⃣" : "EU-Horde", "2️⃣": "EU-Alliance", "3️⃣": "US-Horde", "4️⃣": "US-Alliance"}
need_key = {"✅": "Да", "❌": "Нет"}
roles = {"1️⃣" : "Tank", "2️⃣": "Dps", "3️⃣": "Heal"}
armors_tank = {"1️⃣" : "Латы", "2️⃣": "Кожа", "3️⃣": "Без брони"}
armors_other = {"1️⃣" : "Латы", "2️⃣": "Кольчуга", "3️⃣": "Кожа", "4️⃣": "Ткань", "5️⃣": "Без брони"}